intersectSurfWithCurve(Surface!System.Runtime.CompilerServices.IsConst*,GCurve!System.Runtime.CompilerServices.IsConst*,System.Boolean,System.Boolean,Arr&lt;UVUtils.UV&gt;*,Arr&lt;System.Double&gt;*,Arr&lt;XYZUtils.XYZ&gt;*,Err*,crs.Map&lt;GCurve!System.Runtime.CompilerServices.IsConst**,Arr&lt;XYZUtils.XYZ&gt;,std.less&lt;GCurve!System.Runtime.CompilerServices.IsConst**&gt;,tnallc&lt;std.pair&lt;GCurve!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsConst,Arr&lt;XYZUtils.XYZ&gt;&gt;&gt;&gt;*,Owner&lt;GCurve&gt;*)
Intersect a surface and a curve.
Returns:
SetComparisonResult::Disjoint - if there is no intersection
SetComparisonResult::Subset - if curve is coincident with surface
SetComparisonResult::Overlap - if curve is not coincident and there are intersections
SetComparisonResult::Error - if there is error,  pErr contain error.
Input: the surface and curve to intersect
withinCurveBounds: if true, only return intersections within the curve bounds.
normalizedCurveParams: if true, return normalized curve parameters.
Note: if withinCurveBounds or normalizedCurveParams is true, the curve must be bounded.
Output (all optional):
pSurfParams: the coordinates of the intersection point(s) in the parameter space of the
surface.
pCurveParams: the coordinates of the intersection point(s) in the parameter
space of the curve (listed in the same order as pSurfParams).
pPnts: the array of 3D intersection points (listed in the same order as
pSurfParams and pCurveParams).
pErr: Set to ERR_SUCCESS if successful, failure code if not. This API should
be changed to have return type Err and return SetComparisonResult as an output
argument.
The interface to this routine may be changed in the future in order
to accommodate more general intersection types (e.g., a curve/surface
intersection may consist of isolated points, curves of tangency, etc.).